choimyungchul/r21_Plus_PsrasmTest/rt700_dual_core_low_power_thermometer/armgcc/examples/_boards/mimxrt700evk/board.c
    uint16_t cr1Register[2] = {0x0, 0x0};

    /* Enable CLKn. */
    (void)xspi_hyper_ram_get_mcr(base, ((1U << 11) | (1U << 0)), (uint8_t *)cr1Register);
    cr1Register[1] &= ~(0x01 << 6); /* enable ckn */
    (void)xspi_hyper_ram_write_mcr(base, ((1U << 12) | (1U << 0)), (uint8_t *)cr1Register);

#if (defined(BOARD_PSRAM_ENABLE_VARIABLE_LATENCY) && BOARD_PSRAM_ENABLE_VARIABLE_LATENCY)
    /* Following code to enable variable latency for hyperRAM */
    uint16_t cr0Register[2] = {0x0U, 0x0U};

    (void)xspi_hyper_ram_get_mcr(base, (1U << 11), (uint8_t *)cr0Register);

    cr0Register[1] &= ~(1U << 3U);
    cr0Register[0] &= ~(0x07 << 4); /* Clear drive strength */
    cr0Register[0] |= (0x03 << 4);  /* 46Ohms */

    (void)xspi_hyper_ram_write_mcr(base, (1U << 11), (uint8_t *)cr0Register);
#endif
    /* Updated address mode for AHB access. */
    psRamDeviceConfig.addrMode = kXSPI_Device4ByteAddressable;
    XSPI_SetDeviceConfig(base, &psRamDeviceConfig);
}


#if 1
#define XSPI_PSRAM_CMD_LUT_SEQ_IDX_BURST_READ   0U
#define XSPI_PSRAM_CMD_LUT_SEQ_IDX_BURST_WRITE  1U
#define XSPI_PSRAM_CMD_LUT_SEQ_IDX_REG_READ     2U
#define XSPI_PSRAM_CMD_LUT_SEQ_IDX_REG_WRITE    3U
#define XSPI_PSRAM_CMD_LUT_SEQ_IDX_RESET        4U
#define XSPI_PSRAM_CUSTOM_LUT_LENGTH            (5U * 5U)
#define XSPI_PSRAM_FALLBACK_PAGE_SIZE_BYTES     2048UL
#define XSPI_PSRAM_FALLBACK_DEVICE_SIZE_KB      0x8000UL
#define XSPI_PSRAM_READ_DUMMY_CYCLES            4U /* Default LC=5 cycles. LUT operand is cycles - 1. */
#define XSPI_PSRAM_WRITE_DUMMY_CYCLES           4U /* Default WLC=5 cycles. LUT operand is cycles - 1. */
#define XSPI_PSRAM_PATTERN_CHUNK_WORDS          64U
#define XSPI_PSRAM_TEST_WORDS                   64U
#define XSPI_PSRAM_TEST_OFFSET                  0x00010000U
#define XSPI_PSRAM_STRESS_BYTES                 (64U * 1024U)
#define XSPI_PSRAM_TEST_SKIPPED                 ((status_t)0x5A5A0001U)

static status_t XSPI2_PSRAM_SendIpCommand(XSPI_Type *base,
                                         uint8_t seqIndex,
                                         xspi_command_type_t cmdType,
                                         uint32_t deviceAddress,
                                         uint32_t *data,
                                         size_t dataSize)
{
    xspi_transfer_t transfer = {0};

    transfer.deviceAddress  = deviceAddress;
    transfer.cmdType        = cmdType;
    transfer.seqIndex       = seqIndex;
    transfer.targetGroup    = kXSPI_TargetGroup0;
    transfer.data           = data;
    transfer.dataSize       = dataSize;
    transfer.lockArbitration = false;

    return XSPI_TransferBlocking(base, &transfer);
}

status_t XSPI_PSRAM_Init(XSPI_Type *base)
{
    xspi_config_t xspiConfig;
    xspi_ahb_access_config_t ahbAccessConfig;
    xspi_ip_access_config_t ipAccessConfig;
    xspi_ahb_write_config_t ahbWriteConfig;
    xspi_device_ddr_config_t ddrConfig;
    xspi_device_config_t deviceConfig;
    status_t status;
    uint32_t xspiRootClkHz;
    uint32_t xspiAmbaBase;
    const uint32_t customLUT[XSPI_PSRAM_CUSTOM_LUT_LENGTH] = {
        /* APS256XXN-OB9 Xccela linear burst read: 0x20. */
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_BURST_READ + 0U] = XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0x20,
                                                                     kXSPI_Command_DDR, kXSPI_8PAD, 0x00),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_BURST_READ + 1U] = XSPI_LUT_SEQ(kXSPI_Command_RADDR_DDR, kXSPI_8PAD, 0x20,
                                                                     kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, XSPI_PSRAM_READ_DUMMY_CYCLES),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_BURST_READ + 2U] = XSPI_LUT_SEQ(kXSPI_Command_READ_DDR, kXSPI_8PAD, 0x04,
                                                                     kXSPI_Command_STOP, kXSPI_1PAD, 0x0),

        /* APS256XXN-OB9 Xccela linear burst write: 0xA0. */
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_BURST_WRITE + 0U] = XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0xA0,
                                                                     kXSPI_Command_DDR, kXSPI_8PAD, 0x00),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_BURST_WRITE + 1U] = XSPI_LUT_SEQ(kXSPI_Command_RADDR_DDR, kXSPI_8PAD, 0x20,
                                                                     kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, XSPI_PSRAM_WRITE_DUMMY_CYCLES),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_BURST_WRITE + 2U] = XSPI_LUT_SEQ(kXSPI_Command_WRITE_DDR, kXSPI_8PAD, 0x04,
                                                                     kXSPI_Command_STOP, kXSPI_1PAD, 0x0),

        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_REG_READ + 0U] = XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0x40,
                         	 	 	 	 	 	 	 	   	   	   	    kXSPI_Command_RADDR_DDR, kXSPI_8PAD, 0x18),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_REG_READ + 1U] = XSPI_LUT_SEQ(kXSPI_Command_CADDR_DDR, kXSPI_8PAD, 0x10,
                          kXSPI_Command_DUMMY_SDR, kXSPI_8PAD, XSPI_PSRAM_READ_DUMMY_CYCLES),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_REG_READ + 2U] = XSPI_LUT_SEQ(kXSPI_Command_READ_DDR, kXSPI_8PAD, 0x08,
                         	 	 	 	 	 	 	 	 	 	 	 	kXSPI_Command_STOP, kXSPI_1PAD, 0x0),

        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_REG_WRITE + 0U] = XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0xC0,
                         	 	 	 	 	 	 	 	 	 	 	 	 kXSPI_Command_RADDR_DDR, kXSPI_8PAD, 0x18),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_REG_WRITE + 1U] = XSPI_LUT_SEQ(kXSPI_Command_CADDR_DDR, kXSPI_8PAD, 0x10,
                         	 	 	 	 	 	 	 	 	 	 	 	 kXSPI_Command_WRITE_DDR, kXSPI_8PAD, 0x02),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_REG_WRITE + 2U] = XSPI_LUT_SEQ(kXSPI_Command_STOP, kXSPI_1PAD, 0x0,
                         	 	 	 	 	 	 	 	 	 	 	 	 kXSPI_Command_STOP, kXSPI_1PAD, 0x0),

        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_RESET + 0U] = XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0xFF,
                                                                     kXSPI_Command_DDR, kXSPI_8PAD, 0x00),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_RESET + 1U] = XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0x00,
                                                                     kXSPI_Command_DDR, kXSPI_8PAD, 0x00),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_RESET + 2U] = XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0x00,
                                                                     kXSPI_Command_DDR, kXSPI_8PAD, 0x00),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_RESET + 3U] = XSPI_LUT_SEQ(kXSPI_Command_DDR, kXSPI_8PAD, 0x00,
                                                                     kXSPI_Command_DDR, kXSPI_8PAD, 0x00),
        [5U * XSPI_PSRAM_CMD_LUT_SEQ_IDX_RESET + 4U] = XSPI_LUT_SEQ(kXSPI_Command_STOP, kXSPI_1PAD, 0x0,
                                                                     kXSPI_Command_STOP, kXSPI_1PAD, 0x0),
    };

