choimyungchul/r21_Plus_PsrasmTest/rt700_dual_core_low_power_thermometer/armgcc/examples/_boards/mimxrt700evk/board.c
    if (base == XSPI1)
    {
        POWER_DisablePD(kPDRUNCFG_APD_XSPI1);
        POWER_DisablePD(kPDRUNCFG_PPD_XSPI1);
        POWER_ApplyPD();
        CLOCK_AttachClk(kFRO0_DIV1_to_XSPI1);
        CLOCK_SetClkDiv(kCLOCK_DivXspi1Clk, 2U); /* 192 MHz / 2 = 96 MHz. */
        xspiRootClkHz = CLOCK_GetFreq(kCLOCK_Xspi1Clk);
        xspiAmbaBase  = XSPI1_AMBA_BASE;
    }
    else if (base == XSPI2)
    {
        POWER_DisablePD(kPDRUNCFG_APD_XSPI2);
        POWER_DisablePD(kPDRUNCFG_PPD_XSPI2);
        POWER_ApplyPD();
        CLOCK_AttachClk(kFRO0_DIV1_to_XSPI2);
        CLOCK_SetClkDiv(kCLOCK_DivXspi2Clk, 2U); /* 192 MHz / 2 = 96 MHz. */
        xspiRootClkHz = CLOCK_GetFreq(kCLOCK_Xspi2Clk);
        xspiAmbaBase  = XSPI2_AMBA_BASE;
    }
    else
    {
        return kStatus_InvalidArgument;
    }

    ahbWriteConfig.AWRSeqIndex          = XSPI_PSRAM_CMD_LUT_SEQ_IDX_BURST_WRITE;
    ahbWriteConfig.blockRead            = false;
    ahbWriteConfig.blockSequenceWrite   = false;
    ahbWriteConfig.pageWaitTimeoutValue = 0UL;
    ahbWriteConfig.policy               = kXSPI_SoftwareClearPPWFlag;

    xspiConfig.ptrAhbAccessConfig = &ahbAccessConfig;
    xspiConfig.ptrIpAccessConfig  = &ipAccessConfig;
    XSPI_GetDefaultConfig(&xspiConfig);

    xspiConfig.ptrAhbAccessConfig->ARDSeqIndex                 = XSPI_PSRAM_CMD_LUT_SEQ_IDX_BURST_READ;
    xspiConfig.ptrAhbAccessConfig->ahbErrorPayload.highPayload = 0x5A5A5A5AU;
    xspiConfig.ptrAhbAccessConfig->ahbErrorPayload.lowPayload  = 0x5A5A5A5AU;
    xspiConfig.ptrAhbAccessConfig->enableAHBBufferWriteFlush   = true;
    xspiConfig.ptrAhbAccessConfig->enableAHBPrefetch           = false;
    xspiConfig.ptrAhbAccessConfig->ahbSplitSize                = kXSPI_AhbSplitSize64b;
    xspiConfig.ptrAhbAccessConfig->ptrAhbWriteConfig           = &ahbWriteConfig;

    ddrConfig.ddrDataAlignedClk         = kXSPI_DDRDataAlignedWith2xInternalRefClk;
    ddrConfig.enableByteSwapInOctalMode = false;
    ddrConfig.enableDdr                 = true;

    memset(&deviceConfig, 0, sizeof(deviceConfig));
    if (xspiRootClkHz == 0U)
    {
        return kStatus_Fail;
    }
    deviceConfig.xspiRootClk                                   = xspiRootClkHz;
    deviceConfig.enableCknPad                                  = false;
    deviceConfig.deviceInterface                               = kXSPI_StrandardExtendedSPI;
    deviceConfig.interfaceSettings.strandardExtendedSPISettings.pageSize =
        XSPI_PSRAM_FALLBACK_PAGE_SIZE_BYTES;
    deviceConfig.CSHoldTime                      = 3U;
    deviceConfig.CSSetupTime                     = 3U;
    deviceConfig.sampleClkConfig.sampleClkSource = kXSPI_SampleClkFromExternalDQS;
    /* APS256XXN asserts DQS before the first valid read data. Enable the
     * controller latency compensation so the first byte is not discarded. */
    deviceConfig.sampleClkConfig.enableDQSLatency = false;
    deviceConfig.sampleClkConfig.dllConfig.dllMode = kXSPI_AutoUpdateMode;
    deviceConfig.sampleClkConfig.dllConfig.useRefValue = true;
    deviceConfig.sampleClkConfig.dllConfig.enableCdl8 = true;
    deviceConfig.addrMode                     = kXSPI_DeviceByteAddressable;
    /* The Xccela LUT sends the complete A3..A0 address through one 32-bit
     * RADDR instruction.  Keep CAS at zero so XSPI does not strip low address
     * bits for a separate CADDR phase. */
    deviceConfig.columnAddrWidth              = 0U;
    deviceConfig.enableCASInterleaving        = false;
    deviceConfig.deviceSize[0]                = XSPI_PSRAM_FALLBACK_DEVICE_SIZE_KB;
    deviceConfig.deviceSize[1]                = XSPI_PSRAM_FALLBACK_DEVICE_SIZE_KB;
    deviceConfig.ptrDeviceRegInfo             = NULL;
    deviceConfig.ptrDeviceDdrConfig           = &ddrConfig;

    XSPI_Init(base, &xspiConfig);
    status = XSPI_SetDeviceConfig(base, &deviceConfig);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* APS256XXN uses the DQS pin as active-high DM during writes.  The SDK
     * clears DQS_OUT_EN for StandardExtendedSPI devices, which prevents AHB
     * byte/halfword strobes from reaching the PSRAM. */
    XSPI_EnableModule(base, false);
    base->MCR |= XSPI_MCR_DQS_OUT_EN_MASK;
    XSPI_EnableModule(base, true);

    XSPI_UpdateLUT(base, 0U, customLUT, XSPI_PSRAM_CUSTOM_LUT_LENGTH);

    /* The device requires at least 150 us for power-up self-initialization
     * before Global Reset, then at least 2 us before the next command. */
    SDK_DelayAtLeastUs(150U, SystemCoreClock);
    status = XSPI2_PSRAM_SendIpCommand(base, XSPI_PSRAM_CMD_LUT_SEQ_IDX_RESET, kXSPI_Command, xspiAmbaBase, NULL, 0U);
    if (status != kStatus_Success)
    {
        return status;
    }

    SDK_DelayAtLeastUs(10U, SystemCoreClock);
    XSPI_ClearAhbBuffer(base);
    XSPI_ClearTxBuffer(base);
    XSPI_ClearRxBuffer(base);

    /* Frame-buffer consumers such as LCDIF/GPU access PSRAM as non-CPU AHB
     * masters. Route buffer 0-2 away from CPU-specific master IDs so those
     * masters can use the all-master AHB buffer. */
    BOARD_ReConfigXspiAhbBuffer(base);

    return kStatus_Success;
}

status_t XSPI_PSRAM_MemoryTest(XSPI_Type *base)
{
    uint32_t xspiAmbaBase;
    uint32_t xspiInstance;
    uint32_t backup[XSPI_PSRAM_TEST_WORDS];
    uint32_t expected;
    uint32_t actual;

    if (base == XSPI1)
    {
        xspiAmbaBase = XSPI1_AMBA_BASE;
        xspiInstance = 1U;
    }
    else if (base == XSPI2)
    {
        xspiAmbaBase = XSPI2_AMBA_BASE;
        xspiInstance = 2U;
    }
    else
    {
        return kStatus_InvalidArgument;
    }

    volatile uint32_t *testAddr = (volatile uint32_t *)(xspiAmbaBase + XSPI_PSRAM_TEST_OFFSET);

    for (uint32_t i = 0U; i < XSPI_PSRAM_TEST_WORDS; i++)
    {
        backup[i] = testAddr[i];
    }

    for (uint32_t i = 0U; i < XSPI_PSRAM_TEST_WORDS; i++)
    {
        testAddr[i] = 0xA5A50000UL ^ (i * 0x01010101UL);
    }
    __DSB();
    XSPI_ClearAhbBuffer(base);

    for (uint32_t i = 0U; i < XSPI_PSRAM_TEST_WORDS; i++)
    {
        expected = 0xA5A50000UL ^ (i * 0x01010101UL);
        actual   = testAddr[i];
        if (actual != expected)
        {
            PRINTF("XSPI%u PSRAM test FAIL phase=pattern index=%u addr=0x%08X expected=0x%08X actual=0x%08X backup=0x%08X\r\n",
                   (unsigned int)xspiInstance,
                   (unsigned int)i,
                   (unsigned int)&testAddr[i],
                   (unsigned int)expected,
                   (unsigned int)actual,
                   (unsigned int)backup[i]);
            for (uint32_t j = 0U; j < XSPI_PSRAM_TEST_WORDS; j++)
            {
                testAddr[j] = backup[j];
            }
            __DSB();
            XSPI_ClearAhbBuffer(base);
            return kStatus_Fail;
        }
    }

