choimyungchul/r21_Plus_PsrasmTest/rt700_dual_core_low_power_thermometer/armgcc/examples/_boards/mimxrt700evk/board.c
    for (uint32_t i = 0U; i < XSPI_PSRAM_TEST_WORDS; i++)
    {
        testAddr[i] = ~backup[i];
    }
    __DSB();
    XSPI_ClearAhbBuffer(base);

    for (uint32_t i = 0U; i < XSPI_PSRAM_TEST_WORDS; i++)
    {
        if (testAddr[i] != ~backup[i])
        {
            PRINTF("XSPI%u PSRAM test FAIL phase=invert index=%u addr=0x%08X expected=0x%08X actual=0x%08X backup=0x%08X\r\n",
                   (unsigned int)xspiInstance,
                   (unsigned int)i,
                   (unsigned int)&testAddr[i],
                   (unsigned int)(~backup[i]),
                   (unsigned int)testAddr[i],
                   (unsigned int)backup[i]);
            for (uint32_t j = 0U; j < XSPI_PSRAM_TEST_WORDS; j++)
            {
                testAddr[j] = backup[j];
            }
            __DSB();
            XSPI_ClearAhbBuffer(base);
            return kStatus_Fail;
        }
    }

    for (uint32_t i = 0U; i < XSPI_PSRAM_TEST_WORDS; i++)
    {
        testAddr[i] = backup[i];
    }
    __DSB();
    XSPI_ClearAhbBuffer(base);

    return kStatus_Success;
}
#endif


inline static void i2c_release_bus_delay(void)
{
    SDK_DelayAtLeastUs(10U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
}

void BOARD_InitI2c2PinAsGpio(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    /* PORT1 PIN11 is configured as PIO1_11 */
    i2c_iomux[0]        = IOPCTL0->PIO[1][11];
    IOPCTL0->PIO[1][11] = 0x440u; /* GPIO with inputbuffer and pseudo uutput drain enabled. */
    /* PORT1 PIN12 is configured as PIO1_12 */
    i2c_iomux[1]        = IOPCTL0->PIO[1][12];
    IOPCTL0->PIO[1][12] = 0x400U; /* GPIO with pseudo uutput drain enabled. */
}

void BOARD_RestoreI2c2PinMux(void)
{
    IOPCTL0->PIO[1][11] = i2c_iomux[0];
    IOPCTL0->PIO[1][12] = i2c_iomux[1];
}

void BOARD_I2c2RecoverBus(void)
{
    gpio_pin_config_t pin_config = {
        kGPIO_DigitalOutput,
        1U,
    };

    GPIO_PinInit(BOARD_CODEC_I2C_SCL_GPIO, BOARD_CODEC_I2C_SCL_PIN, &pin_config);
    i2c_release_bus_delay();
    
    /* Configure SDA pin as input. */
    pin_config.pinDirection = kGPIO_DigitalInput;
    GPIO_PinInit(BOARD_CODEC_I2C_SDA_GPIO, BOARD_CODEC_I2C_SDA_PIN, &pin_config);

    /* Send pulses on SCL until SDA is released and then send stop. */
    while(true)
    {
        /* SCL pulse - low */
        GPIO_PinWrite(BOARD_CODEC_I2C_SCL_GPIO, BOARD_CODEC_I2C_SCL_PIN, 0U);
        i2c_release_bus_delay();

        /* Check whether SDA line is released */
        if (1U == GPIO_PinRead(BOARD_CODEC_I2C_SDA_GPIO, BOARD_CODEC_I2C_SDA_PIN))
        {
            /* SDA is released, hold it in low */
            pin_config.pinDirection = kGPIO_DigitalOutput;
            pin_config.outputLogic = 0U;
            GPIO_PinInit(BOARD_CODEC_I2C_SDA_GPIO, BOARD_CODEC_I2C_SDA_PIN, &pin_config);

            /* SCL pulse - high */
            GPIO_PinWrite(BOARD_CODEC_I2C_SCL_GPIO, BOARD_CODEC_I2C_SCL_PIN, 1U);
            i2c_release_bus_delay();

            /* Set SDA to high from low - send stop */
            GPIO_PinWrite(BOARD_CODEC_I2C_SDA_GPIO, BOARD_CODEC_I2C_SDA_PIN, 1U);
            i2c_release_bus_delay();

            break;
        }
        else
        {
            /* SCL pulse - high */
            GPIO_PinWrite(BOARD_CODEC_I2C_SCL_GPIO, BOARD_CODEC_I2C_SCL_PIN, 1U);
            i2c_release_bus_delay();
        }
    }
}

#endif /* MIMXRT798S_cm33_core0_SERIES */

#if defined(MIMXRT798S_cm33_core0_SERIES) || defined(MIMXRT798S_cm33_core1_SERIES)
void GlikeyWriteEnable(GLIKEY_Type *base, uint8_t idx)
{
    (void)GLIKEY_SyncReset(base);

    (void)GLIKEY_StartEnable(base, idx);
    (void)GLIKEY_ContinueEnable(base, GLIKEY_CODEWORD_STEP1);
    (void)GLIKEY_ContinueEnable(base, GLIKEY_CODEWORD_STEP2);
    (void)GLIKEY_ContinueEnable(base, GLIKEY_CODEWORD_STEP3);
    (void)GLIKEY_ContinueEnable(base, GLIKEY_CODEWORD_STEP_EN);
}

void GlikeyClearConfig(GLIKEY_Type *base)
{
    (void)GLIKEY_SyncReset(base);
}

/* Disable the secure check for AHBSC and enable periperhals/sram access for masters */
void BOARD_InitAHBSC(void)
{
#if defined(MIMXRT798S_cm33_core0_SERIES)
    GlikeyWriteEnable(GLIKEY0, 1U);
    AHBSC0->MISC_CTRL_DP_REG = 0x000086aa;
    AHBSC0->MISC_CTRL_REG    = 0x000086aa; /* AHBSC0 MISC_CTRL_REG, disable Privilege & Secure checking. */

    GlikeyWriteEnable(GLIKEY0, 7U);
    /* Enable arbiter0 accessing SRAM */
    AHBSC0->COMPUTE_ARB0RAM_ACCESS_ENABLE = 0x3FFFFFFF;
    AHBSC0->SENSE_ARB0RAM_ACCESS_ENABLE   = 0x3FFFFFFF;
    AHBSC0->MEDIA_ARB0RAM_ACCESS_ENABLE   = 0x3FFFFFFF;
    AHBSC0->NPU_ARB0RAM_ACCESS_ENABLE     = 0x3FFFFFFF;
    AHBSC0->HIFI4_ARB0RAM_ACCESS_ENABLE   = 0x3FFFFFFF;
#endif

    GlikeyWriteEnable(GLIKEY1, 1U);
    AHBSC3->MISC_CTRL_DP_REG = 0x000086aa;
    AHBSC3->MISC_CTRL_REG    = 0x000086aa; /* AHBSC3 MISC_CTRL_REG, disable Privilege & Secure checking.*/

    GlikeyWriteEnable(GLIKEY1, 9U);
    /* Enable arbiter1 accessing SRAM */
    AHBSC3->COMPUTE_ARB1RAM_ACCESS_ENABLE = 0x3FFFFFFF;
    AHBSC3->SENSE_ARB1RAM_ACCESS_ENABLE   = 0x3FFFFFFF;
    AHBSC3->MEDIA_ARB1RAM_ACCESS_ENABLE   = 0x3FFFFFFF;
    AHBSC3->NPU_ARB1RAM_ACCESS_ENABLE     = 0x3FFFFFFF;
    AHBSC3->HIFI4_ARB1RAM_ACCESS_ENABLE   = 0x3FFFFFFF;
    AHBSC3->HIFI1_ARB1RAM_ACCESS_ENABLE   = 0x3FFFFFFF;

    GlikeyWriteEnable(GLIKEY1, 8U);
    /* Access enable for COMPUTE domain masters to common APB peripherals.*/
    AHBSC3->COMPUTE_APB_PERIPHERAL_ACCESS_ENABLE = 0xffffffff;
    AHBSC3->SENSE_APB_PERIPHERAL_ACCESS_ENABLE   = 0xffffffff;
    GlikeyWriteEnable(GLIKEY1, 7U);
    AHBSC3->COMPUTE_AIPS_PERIPHERAL_ACCESS_ENABLE = 0xffffffff;
    AHBSC3->SENSE_AIPS_PERIPHERAL_ACCESS_ENABLE   = 0xffffffff;

    GlikeyWriteEnable(GLIKEY2, 1U);
    /*Disable secure and secure privilege checking. */
    AHBSC4->MISC_CTRL_DP_REG = 0x000086aa;
    AHBSC4->MISC_CTRL_REG    = 0x000086aa;

#if defined(MIMXRT798S_cm33_core0_SERIES)
    GlikeyClearConfig(GLIKEY0);
#endif
    GlikeyClearConfig(GLIKEY1);
    GlikeyClearConfig(GLIKEY2);
}
#endif /* MIMXRT798S_cm33_core0_SERIES || MIMXRT798S_cm33_core1_SERIES */

#if defined(SDK_I2C_BASED_COMPONENT_USED) && SDK_I2C_BASED_COMPONENT_USED
void BOARD_I2C_Init(LPI2C_Type *base, uint32_t clkSrc_Hz)
{
    lpi2c_master_config_t i2cConfig = {0};

